app/controllers/candidates_controller.rb

SELECT  "candidates".* FROM "candidates" WHERE "candidates"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
  	@candidate = Candidate.find(params[:lname])