app/controllers/quizzes_controller.rb

SELECT  "voters".* FROM "voters" WHERE "voters"."id" = ?  ORDER BY "voters"."id" DESC LIMIT 1  [["id", 5]]
UPDATE "voters" SET "libVal" = ?, "updated_at" = ? WHERE "voters"."id" = ?  [["libVal", 10], ["updated_at", "2016-02-10 19:44:12.703446"], ["id", 9]]
---
  def create

    @quiz = Quiz.new(quiz_params)
    @quiz.voter_id = current_voter.id
    @voter = Voter.where(id:current_voter.id).last
    @voter.libVal = 0
    @voter.conVal = 0
    @voter.save