app/controllers/voters_controller.rb

  def create

  	@voter = Voter.new(voter_params)
  	if @voter.save
---
INSERT INTO "voters" ("email", "password", "conVal", "libVal", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["email", "e@e"], ["password", "1234"], ["conVal", 0], ["libVal", 0], ["created_at", "2016-02-09 21:39:27.630530"], ["updated_at", "2016-02-09 21:39:27.630530"]]

  def show
  	@voter = Voter.find(params[:id])
---
SELECT  "voters".* FROM "voters" WHERE "voters"."id" = ? LIMIT 1  [["id", 0]]

  def edit
  	@voter = Voter.find(params[:id])
---
SELECT  "voters".* FROM "voters" WHERE "voters"."id" = ? LIMIT 1  [["id", 3]]

  def update
  	@voter = Voter.find(params[:id])
  	if @voter.update_attributes(voter_params)
---
SELECT  "voters".* FROM "voters" WHERE "voters"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "voters" SET "password" = ?, "updated_at" = ? WHERE "voters"."id" = ?  [["password", "345"], ["updated_at", "2016-02-05 16:04:48.197516"], ["id", 2]]